In [1]:
name = "MyName"

In [2]:
name[2]

'N'

In [14]:
for item in "MyName":
    print(item)

M
y
N
a
m
e

In [59]:
list1 = [4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28]

In [64]:
for i in list1:
    print(i)

4
6
8
10
12
14
16
18
20
22
24
26
28

In [15]:
range(5)

range(0, 5)

In [68]:
for i in range(0,10):
    print(i)

0
1
2
3
4
5
6
7
8
9

In [29]:
for i in range(2,21,2):
    print(i)

2
4
6
8
10
12
14
16
18
20

In [8]:
for  e in range(0,10,3):
    print(e)

0
3
6
9

In [3]:
for i in range(10,15):
    print(i)

10
11
12
13
14

Q2. write a programe to print first 10 natural number.

In [30]:
for i in range(1,11):
    print(i)

1
2
3
4
5
6
7
8
9
10

Q3. write a programe to print first 10 even numbers.

In [72]:
for i in range(0,19,2):
    print(i)

0
2
4
6
8
10
12
14
16
18

Q4. write a programe to print first 10 odd numbers.

In [9]:
for i in range(1,20,2):
    print(i)

1
3
5
7
9
11
13
15
17
19

In [32]:
# Create a sequence of numbers from 3 to 5, and print each item in the sequence:
for i in range(3,6,1):
    print(i)

3
4
5

In [36]:
for i in range(0,19):
    print(i)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18

Q5. write a programe to print first 10 even numbers in reverse order.

In [40]:
for i in range(18,-1,-2):
    print(i)

18
16
14
12
10
8
6
4
2
0

Q6. write a programe to print table of a number accepted from user.

In [12]:
number = int(input("please enter the number"))
for i in range( 1,11):
    print( number * i)

please enter the number 5

5
10
15
20
25
30
35
40
45
50

Q7. write a programe to find the factorial of a number.

5! = 5*4*3*2*1 = 120
4! = 4*3*2*1 = 24
3! = 3*2*1= 6
2!= 2*1 = 2
1! = 1
0! = 1
6! = 6*5*4*3*2*1

In [4]:
for i in range(1,6):
    print(i)

1
2
3
4
5

In [6]:
number = int(input("please enter the number"))
factorial = 1
for i in range(1,number + 1):
    factorial = factorial * i
print(factorial)

please enter the number 5

120

In [15]:
netPayment = 200
OverTime = 20 
taxDeduction = 35
netPayment = netPayment + OverTime
netPayment = netPayment - taxDeduction
netPayment

185

In [41]:
import pandas as pd

In [42]:
empid = ["E90","E87"]
Name = ["Asif" ,"Jignesh"]

In [43]:
data = {"Emp_id" : empid , "NAME" : Name}

In [44]:
emp1 = pd.DataFrame(data)
emp1

  Emp_id     NAME
0    E90     Asif
1    E87  Jignesh

In [46]:
empid_1 = ["E22","E74", "E90"]
Name_1 = ["Minil" ,"Akash" , "Asif"]

In [47]:
data = {"Emp_id" : empid_1 , "NAME" : Name_1}

In [48]:
emp2 = pd.DataFrame(data)
emp2

  Emp_id   NAME
0    E22  Minil
1    E74  Akash
2    E90   Asif

In [58]:
pd.concat([emp1,emp2 ],ignore_index = True)

  Emp_id     NAME
0    E90     Asif
1    E87  Jignesh
2    E22    Minil
3    E74    Akash
4    E90     Asif

In [52]:
employees = pd.concat([emp1,emp2] ,ignore_index = True)
employees

  Emp_id     NAME
0    E90     Asif
1    E87  Jignesh
2    E22    Minil
3    E74    Akash
4    E90     Asif

In [35]:
# check the duplicates after concatenation:

In [53]:
employees.duplicated()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [54]:
employees.drop_duplicates()

  Emp_id     NAME
0    E90     Asif
1    E87  Jignesh
2    E22    Minil
3    E74    Akash

In [56]:
employees

  Emp_id     NAME
0    E90     Asif
1    E87  Jignesh
2    E22    Minil
3    E74    Akash
4    E90     Asif

In [55]:
employees2 = employees.drop_duplicates()
employees2

  Emp_id     NAME
0    E90     Asif
1    E87  Jignesh
2    E22    Minil
3    E74    Akash

In [38]:
empid = ['E87','E22','E49']
City  = ['Mumbai','Banglore','Pune'] 
State = ['Maharashtra','Karnataka','Maharashtra']

In [42]:
data = {"Emp_id" : empid ,"City" : City,"State" : State }

In [43]:
address= pd.DataFrame(data)
address

  Emp_id      City        State
0    E87    Mumbai  Maharashtra
1    E22  Banglore    Karnataka
2    E49      Pune  Maharashtra

In [45]:
inner = pd.merge(employees2,address ,on  = "Emp_id" , how = "inner")
inner

  Emp_id     NAME      City        State
0    E87  Jignesh    Mumbai  Maharashtra
1    E22    Minil  Banglore    Karnataka

# left Outer Join

In [47]:
leftouter = pd.merge(employees2,address ,on  = "Emp_id" , how = "left")
leftouter

  Emp_id     NAME      City        State
0    E90     Asif       NaN          NaN
1    E87  Jignesh    Mumbai  Maharashtra
2    E22    Minil  Banglore    Karnataka
3    E74    Akash       NaN          NaN

## Right Outer Join

In [44]:
rightOuterJoin = pd.merge(employees2,address ,on  = "empid" , how = "right")
rightOuterJoin

  empid   Name      City        State
0   E87  Basit    Mumbai  Maharashtra
1   E22  Minil  Banglore    Karnataka
2   E49    NaN      Pune  Maharashtra

## full outer Join

In [47]:
full = pd.merge(employees2,address ,on  = "empid" , how = "outer")
full

  empid   Name      City        State
0   E90   Asif       NaN          NaN
1   E87  Basit    Mumbai  Maharashtra
2   E22  Minil  Banglore    Karnataka
3   E74  Akash       NaN          NaN
4   E49    NaN      Pune  Maharashtra

In [46]:
# Salary Data
sal = pd.DataFrame({'empid':['E87','E22','E74','E90','E49'],
 'salary':['$10,000','$30,000','$20,000','$60,000','$90,000']})
sal

  empid   salary
0   E87  $10,000
1   E22  $30,000
2   E74  $20,000
3   E90  $60,000
4   E49  $90,000

In [48]:
employee_details = pd.merge( full,sal ,on = "empid" , how = "inner")
employee_details

  empid   Name      City        State   salary
0   E90   Asif       NaN          NaN  $60,000
1   E87  Basit    Mumbai  Maharashtra  $10,000
2   E22  Minil  Banglore    Karnataka  $30,000
3   E74  Akash       NaN          NaN  $20,000
4   E49    NaN      Pune  Maharashtra  $90,000

In [51]:
# Employee experience
exp = pd.DataFrame(
                   {
                    'employee_id':['E87','E22','E74','E90','E49'],
                    'experience' :['5 years','3 years','7 years','2 years','10 years']
                   }
                  )
exp

  employee_id experience
0         E87    5 years
1         E22    3 years
2         E74    7 years
3         E90    2 years
4         E49   10 years

In [52]:
full_employee_details = pd.merge( employee_details , exp ,
                                  left_on = "empid" ,
                                  right_on = "employee_id",
                                  how = "inner")
full_employee_details

  empid   Name      City        State   salary employee_id experience
0   E90   Asif       NaN          NaN  $60,000         E90    2 years
1   E87  Basit    Mumbai  Maharashtra  $10,000         E87    5 years
2   E22  Minil  Banglore    Karnataka  $30,000         E22    3 years
3   E74  Akash       NaN          NaN  $20,000         E74    7 years
4   E49    NaN      Pune  Maharashtra  $90,000         E49   10 years